In [21]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
dataset=pd.read_csv("iphone_purchase_records.csv")

In [22]:
dataset.head()

   Gender  Age  Salary  Purchase Iphone
0    Male   19   19000                0
1    Male   35   20000                0
2  Female   26   43000                0
3  Female   27   57000                0
4    Male   19   76000                0

In [23]:
gender = pd.get_dummies(dataset["Gender"],drop_first=True)

In [24]:
gender.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [25]:
dataset=pd.concat([dataset,gender],axis=1)

In [26]:
dataset.head()

   Gender  Age  Salary  Purchase Iphone  Male
0    Male   19   19000                0     1
1    Male   35   20000                0     1
2  Female   26   43000                0     0
3  Female   27   57000                0     0
4    Male   19   76000                0     1

In [27]:
dataset.drop("Gender",axis=1,inplace=True)
dataset.head()

   Age  Salary  Purchase Iphone  Male
0   19   19000                0     1
1   35   20000                0     1
2   26   43000                0     0
3   27   57000                0     0
4   19   76000                0     1

In [28]:
x=dataset.drop("Purchase Iphone",axis=1)
y=dataset.iloc[:,2]
print(x)
print(y)

     Age  Salary  Male
0     19   19000     1
1     35   20000     1
2     26   43000     0
3     27   57000     0
4     19   76000     1
..   ...     ...   ...
395   46   41000     0
396   51   23000     1
397   50   20000     0
398   36   33000     1
399   49   36000     0

[400 rows x 3 columns]
0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchase Iphone, Length: 400, dtype: int64

In [29]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=0)

In [30]:
x_train.head()

     Age  Salary  Male
250   44   39000     0
63    32  120000     1
312   38   50000     0
159   32  135000     0
283   52   21000     0

In [31]:
x_test.head()

     Age  Salary  Male
132   30   87000     1
309   38   50000     0
341   35   75000     1
196   30   79000     0
246   35   50000     0

In [32]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

In [39]:
from sklearn.neighbors import KNeighborsClassifier
#metric minkowski and p =2 is euclidean distance
#metric  = minkowski and p = 1 is Manbattan distance
classifier = KNeighborsClassifier(n_neighbors=5,metric = "minkowski",p=2)
classifier.fit(x_train,y_train)

KNeighborsClassifier()

In [48]:
y_pred=classifier.predict(x_test)

In [49]:
from sklearn import metrics
cm=metrics.confusion_matrix(y_test,y_pred)
print(cm)
accuracy = metrics.accuracy_score(y_test,y_pred)
print("accuracy score is: ",accuracy)

[[64  4]
 [ 3 29]]
accuracy score is:  0.93